/*
  SkypeWiFi.strings
  Skype WiFi

  Created by John Chang on 2012-06-05.
  Copyright (c) 2012 Skype. All rights reserved.
*/

/* === All clients === */

"INTRO_HEADER" = "Introducing Skype WiFi";
"INTRO_SUBHEADER" = "Get online at public WiFi hotspots and pay only for the minutes you use with Skype Credit.";
"INTRO_ICON_WIFI" = "Use Skype, check email and surf the web.";
"INTRO_ICON_GLOBE" = "Skype WiFi is available at over one million locations worldwide.";
"INTRO_ICON_SKYPECREDIT" = "Only pay for the minutes you use.";

"STATE_CHECKINGNETWORK_HEADER" = "Please wait…";
"STATE_CHECKINGNETWORK_SUBHEADER" = "Checking network for Skype WiFi";

"STATE_JOINWIFI_HEADER" = "You’re not connected to WiFi";
"STATE_JOINWIFI_SUBHEADER" = "Please join a public WiFi network that supports Skype WiFi.";

"STATE_ALREADYONLINE_HEADER" = "You’re already online";
"STATE_ALREADYONLINE_SUBHEADER" = "Looks like you’re already connected to the internet. Skype WiFi lets you go online at public WiFi hotspots in over 1 million locations worldwide.";

"STATE_GENERALERROR_HEADER" = "Unable to connect";
"STATE_GENERALERROR_SUBHEADER" = "This WiFi network is not responding correctly. Please try connecting to a different network.";

"STATE_CONNECT_HEADER" = "Skype WiFi is available here";
"STATE_CONNECT_TOS_HTML_FORMAT" = "By connecting, I agree to the provider’s <a href=\"%@\">terms&nbsp;of&nbsp;service</a>";

"STATE_CONNECT_BUTTON" = "Connect";
"STATE_CONNECTING_BUTTON" = "Connecting…";

"STATE_CONNECTED_SHORT" = "Connected";
"STATE_CONNECTED_HEADER" = "You’re online with Skype WiFi";

"STATE_CONNECTED_DISCONNECT_BUTTON" = "Disconnect";
"STATE_DISCONNECTING_BUTTON" = "Disconnecting…";

"STATE_NOCREDIT_HEADER" = "Not enough Skype Credit";


/* === Mac only === */

"OK_BUTTON" = "OK";
"LEARNMORE_BUTTON" = "Learn more";
"CLOSE_BUTTON" = "Close";
"GO_BACK_BUTTON" = "Go back";
"CONTINUE_BUTTON" = "Continue";

"REQUIRES_OSX_VERSION_MESSAGE" = "Skype WiFi requires OS X %@ or newer.";

/* if partner is PARTNER_MICROSOFT and account name does not start with "live:" then its a linked account */
"NOT_SUPPORTED_LINKED_ACCOUNT" = "Skype WiFi can’t be used with your Microsoft account yet. Please sign in directly with your Skype name and password instead.";
/* if the partner is PARTNER_MICROSOFT and account name does start with "live:" then its pure MS account login */
"NOT_SUPPORTED_MICROSOFT_ACCOUNT" = "Skype WiFi can’t be used with your Microsoft account yet. Please create a Skype account and sign in directly with it.";

"MAIN_WINDOW_TITLE" = "Skype WiFi";
"MAIN_WINDOW_TITLE_WITH_SSID" = "Skype WiFi — “%@”";

"FLOATER_CONNECTED_TITLE" = "You’re online with Skype WiFi";
"FLOATER_CONNECTED_WISPR_TITLE" = "You’re online";
"FLOATER_CONNECTED_EXPIRES_SOON_TITLE" = "Connection expires soon";

"SETTINGS_CONNECTION_LENGTH_POPOVER_TEXT" = "For your protection, when connected using your Skype Credit, the connection will automatically time out in case you forget to disconnect.";
"SETTINGS_SESSION_LENGTH_NMIN_FORMAT" = "%d minutes";

"STATE_CONNECT_SUBHEADER" = "Connect to the internet on this network using Skype WiFi and only pay for the minutes you use with Skype Credit.";
"STATE_CONNECT_FREE_HEADER" = "Skype WiFi is free here";
"STATE_CONNECT_FREE_SUBHEADER" = "Enjoy free internet access at this hotspot with Skype WiFi. Surf the web, check your email, or just use Skype.";
"STATE_CONNECT_WISPR_HEADER" = "I have an account with this provider";
"STATE_CONNECT_WISPR_SUBHEADER" = "If you already have an account with this provider, enter your credentials here.";

"STATE_CONNECTED_EXPIRES_SOON_HEADER" = "Your internet connection expires soon";
"STATE_CONNECTED_SUBHEADER_FORMAT" = "%@ You can disconnect at any time and you’ll only be charged for the minutes used.";
"STATE_CONNECTED_FREE_SUBHEADER_FORMAT" = "%@";
"COUNTUP_NMIN_FORMAT" = "You’ve been online for about %d minutes.";
"COUNTUP_0MIN" = "You’ve been online for less than a minute.";
"COUNTUP_1MIN" = "You’ve been online for about a minute.";
"STATE_CONNECTED_WISPR_HEADER" = "You’re now online";
"STATE_CONNECTED_WISPR_SUBHEADER" = "You are connected using your account with this hotspot provider. You can disconnect at any time.";
"STATE_CONNECTED_RATE_THIS_HOTSPOT" = "Rate this hotspot";

"STATE_CONNECTED_EXTEND_BUTTON" = "Stay online";
"STATE_CONNECTED_EXTENDING_BUTTON" = "Reconnecting…";

"STATE_NOCREDIT_SUBHEADER" = "You need Skype Credit to pay per minute for internet access with Skype WiFi here.";
"STATE_NOCREDIT_BUTTON" = "Get Skype Credit";


/* === iPad only === */

"STATE_CHECKINGNETWORK_SHORT" = "Checking network";
"STATE_JOINWIFI_SHORT" = "No WiFi";
"STATE_ALREADYONLINE_SHORT" = "Already online";
"STATE_GENERALERROR_SHORT" = "Error";
"STATE_CONNECT_SHORT" = "Available here";
"STATE_NOCREDIT_SHORT" = "No credit";


/* === iPhone/iPad only === */
"TIMEEXPIRE_MINUTES_LEFT_FORMAT" = "%d minutes left";
"TIMEEXPIRE_1MINUTE_LEFT" = "1 minute left";
"TIMEEXPIRE_LESSTHAN_1MINUTE_LEFT" = "Less than a minute left";

"APP_NOTIFICATION_EXPIRES_SOON_TITLE" = "Your internet connection expires soon.";


/* === Standalone clients === */

/* iPhone/iPad */
"LOGIN_SKYPENAME_PLACEHOLDER" = "Skype Name";
"LOGIN_PASSWORD_PLACEHOLDER" = "Password";
"LOGIN_BUTTON" = "Sign in";
"SIGN_OUT_BUTTON" = "Sign out";

/* unused */
"LOGIN_PROBLEMS" = "Problems signing in?";
"LOGIN_CREATE_ACCOUNT" = "Create an account";

/* iPhone/iPad */
"SETTINGS_TITLE" = "Settings";
/* unused */
"SETTINGS_BUTTON" = "Settings";

/* iPhone/iPad */
"ABOUT_VERSION_FORMAT" = "Skype WiFi Version %1$@ (%2$@)";
"ABOUT_COPYRIGHT_FORMAT" = "© %1$d–%2$d Skype and/or Microsoft";
"ABOUT_PATENTPENDING" = "Patent Pending";
"ABOUT_FEEDBACK_BUTTON" = "Feedback";
"ABOUT_LEGAL_BUTTON" = "Legal";
"ABOUT_TRADEMARK" = "The Skype name, associated trade marks and logos and the “S” logo are trade marks of Skype.";
"ABOUT_DISCLAIMER" = "Warning: This program is protected by copyright law and international treaties. Unauthorized reproduction or distribution of this program, or any portion of it, may result in severe criminal and civil penalties and will be prosecuted to the maximum extent possible under the law.";

/* unused */
"PROFILE_BUTTON" = "Profile";
/* iPhone/iPad */
"PROFILE_SKYPENAME" = "Skype Name";
"PROFILE_SKYPECREDIT" = "Skype Credit";
"PROFILE_SKYPECREDIT_NA_VALUE" = "N/A";
"PROFILE_SKYPECREDIT_LOADING_VALUE" = "Loading…";

/* iPhone/iPad */
"USAGE_HOTSPOTSVISITED" = "Hotspots visited";
"USAGE_PREVIOUSCONNECTIONS" = "Previous connections";
"USAGE_LASTUSED" = "Last used";
"USAGE_LASTUSED_NEVER_VALUE" = "Never";

/* unused - "<date> on <hotspot name>" */
"USAGE_LASTUSED_WHENWHERE_VALUE_FORMAT" = "%1$@ on %2$@";
/* unused */
"SUPPORTEDNETWORKS_POPULARLOCATIONS" = "Popular locations";
"SUPPORTEDNETWORKS_PROVIDERS" = "Providers";
